Duet3D/Duet3Expansion/src/atmel/SAMDA1_DFP/1.2.50/samda1b/atdf/ATSAMDA1J15B.atdf
        <module name="TC" id="U2212" version="1.3.1">
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="24"/>
              <param name="GCLK_ID" value="27"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="27"/>
              <param name="GCLK_ID" value="28"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB10"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="30"/>
              <param name="GCLK_ID" value="28"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB02"/>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="33"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x42003C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PB00"/>
              <signal group="WO" index="0" function="E" pad="PB22"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
              <signal group="WO" index="1" function="E" pad="PB01"/>
              <signal group="WO" index="1" function="E" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="36"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="79"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="1.2.2">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PB10"/>
              <signal group="WO" index="4" function="F" pad="PB16"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PB11"/>
              <signal group="WO" index="5" function="F" pad="PB17"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="6" function="F" pad="PA12"/>
              <signal group="WO" index="6" function="F" pad="PA20"/>
              <signal group="WO" index="6" function="F" pad="PB12"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="7" function="F" pad="PA13"/>
              <signal group="WO" index="7" function="F" pad="PA21"/>
              <signal group="WO" index="7" function="F" pad="PB13"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="13"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="26"/>
              <param name="MASTER" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="TYPE" value="1"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA08"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="2" function="F" pad="PB30"/>
              <signal group="WO" index="3" function="F" pad="PA09"/>
              <signal group="WO" index="3" function="F" pad="PA25"/>
              <signal group="WO" index="3" function="F" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="18"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="24"/>
              <param name="GCLK_ID" value="26"/>
              <param name="MASTER" value="1"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="4"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0"/>
              <param name="TYPE" value="2"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
