Duet3D/Duet3Expansion/src/atmel/SAMDA1_DFP/1.2.50/samda1b/atdf/ATSAMDA1J15B.atdf
    <module name="PM" id="U2206" version="2.1.2" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
        </register>
        <register name="SLEEP" offset="0x1" rw="RW" size="1" initval="0x00" caption="Sleep Mode">
          <bitfield name="IDLE" caption="Idle Mode Configuration" mask="0x3" values="PM_SLEEP__IDLE"/>
        </register>
        <register name="EXTCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="External Reset Controller">
          <bitfield name="SETDIS" caption="External Reset Disable" mask="0x1"/>
        </register>
        <register name="CPUSEL" offset="0x8" rw="RW" size="1" initval="0x00" caption="CPU Clock Select">
          <bitfield name="CPUDIV" caption="CPU Prescaler Selection" mask="0x7" values="PM_CPUSEL__CPUDIV"/>
        </register>
        <register name="APBASEL" offset="0x9" rw="RW" size="1" initval="0x00" caption="APBA Clock Select">
          <bitfield name="APBADIV" caption="APBA Prescaler Selection" mask="0x7" values="PM_APBASEL__APBADIV"/>
        </register>
        <register name="APBBSEL" offset="0xA" rw="RW" size="1" initval="0x00" caption="APBB Clock Select">
          <bitfield name="APBBDIV" caption="APBB Prescaler Selection" mask="0x7" values="PM_APBBSEL__APBBDIV"/>
        </register>
        <register name="APBCSEL" offset="0xB" rw="RW" size="1" initval="0x00" caption="APBC Clock Select">
          <bitfield name="APBCDIV" caption="APBC Prescaler Selection" mask="0x7" values="PM_APBCSEL__APBCDIV"/>
        </register>
        <register name="AHBMASK" offset="0x14" rw="RW" size="4" initval="0x0000007F" caption="AHB Mask">
          <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
          <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
          <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x8"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x10"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x20"/>
          <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x40"/>
        </register>
        <register name="APBAMASK" offset="0x18" rw="RW" size="4" initval="0x0000007F" caption="APBA Mask">
          <bitfield name="PAC0_" caption="PAC0 APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="SYSCTRL_" caption="SYSCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x8"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x10"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x20"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x40"/>
        </register>
        <register name="APBBMASK" offset="0x1C" rw="RW" size="4" initval="0x0000007F" caption="APBB Mask">
          <bitfield name="PAC1_" caption="PAC1 APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x8"/>
          <bitfield name="DMAC_" caption="DMAC APB Clock Enable" mask="0x10"/>
          <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x20"/>
          <bitfield name="HMATRIX_" caption="HMATRIX APB Clock Enable" mask="0x40"/>
        </register>
        <register name="APBCMASK" offset="0x20" rw="RW" size="4" initval="0x00010000" caption="APBC Mask">
          <bitfield name="PAC2_" caption="PAC2 APB Clock Enable" mask="0x1"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x10"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x20"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x40"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x80"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x100"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x200"/>
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x400"/>
          <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x800"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x1000"/>
          <bitfield name="TC5_" caption="TC5 APB Clock Enable" mask="0x2000"/>
          <bitfield name="TC6_" caption="TC6 APB Clock Enable" mask="0x4000"/>
          <bitfield name="TC7_" caption="TC7 APB Clock Enable" mask="0x8000"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x10000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x20000"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x40000"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x80000"/>
          <bitfield name="I2S_" caption="I2S APB Clock Enable" mask="0x100000"/>
        </register>
        <register name="INTENCLR" offset="0x34" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x35" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x36" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="RCAUSE" offset="0x38" rw="R" size="1" initval="0x01" caption="Reset Cause">
          <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
          <bitfield name="BOD12" caption="Brown Out 12 Detector Reset" mask="0x2"/>
          <bitfield name="BOD33" caption="Brown Out 33 Detector Reset" mask="0x4"/>
          <bitfield name="EXT" caption="External Reset" mask="0x10"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x20"/>
          <bitfield name="SYST" caption="System Reset Request" mask="0x40"/>
        </register>
      </register-group>
